# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = (input("Введите число: "))
n1=int(n[0])
n2=int(n[1])
n3=int(n[2])
result = (n1+n2+n3)
print(result)
